app/views/movies/index.haml

      = link_to movie.title, movie
    - movie.genres.each do |genre|
---
SELECT "genres".* FROM "genres" INNER JOIN "movie_genres" ON "genres"."id" = "movie_genres"."genre_id" WHERE "movie_genres"."movie_id" = ?  [["movie_id", 8]]