app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdv"], ["description", "sdv"], ["created_at", "2016-03-27 14:56:52.011353"], ["updated_at", "2016-03-27 14:56:52.011353"]]

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "ergsdv"], ["updated_at", "2016-03-28 15:22:25.763517"], ["id", 2]]

  def find_movie
    @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]